INSERT INTO DE_CTL_Patients
(de_surname, de_name, de_patronymic, de_birthday, de_address, de_genderid)
VALUES
('Иванов','Иван','Иванович','1991-04-24','г. Брест, ул. Грибоедова д.6, кв 78', 1),
('Иванова','Иванна','Ивановна','1995-05-27','г. Брест, ул. Екельчика д.14, кв 3', 2),
('Андрейчиков','Адрей','Андреевич','2001-06-10','г. Брест, ул. Бориса Маслова д.5, кв 33', 1),
('Сидоров','Сидр','Сидорович','1999-11-04','г. Брест, ул. Грибоедова д.6, кв 32', 1),
('Петров','Пётр','Петрович','2002-03-16','г. Брест, ул. Бориса Маслова д.5, кв 54', 1),
('Данильчиков','Даниил','Данилович','1998-05-05','г. Брест, ул. Грюндвальская д.18, кв 22', 1);
