-- INSERT INTO DE_CTL_Doctors
-- (de_region, de_office, de_surname, de_name, de_patronymic)
-- VALUES
-- ('Орлова', 'Марья', 'Ивановна');

INSERT INTO DE_CTL_Doctors
(de_region, de_office, de_surname, de_name, de_patronymic)
VALUES
(1,309,'Павлова','Виктория','Сергеевна'),
(2,344,'Безсилко','Андрей','Викторович'),
(4,307,'Азхари','Ахмад','Кадри Саффан'),
(6,336,'Клюсова','Наталия','Николаевна'),
(9,348,'Темпераментова-Андреюк','Влада','Ярославовна'),
(13,315,'Елак','Юлия','Валерьевна'),
(14,313,'Казакевич','Валерия','Вадимовна'),
(15,309,'Козел','Светлана','Андреевна'),
(16,311,'Рак','Валентина','Александровна'),
(17,341,'Михович','Алексей','Павлович'),
(18,344,'Нестерук','Янина','Владимировна');
