DROP PROCEDURE IF EXISTS ГП_ПРОЦ_УДАЛЕНИЕСТУДЕНТОВВЫШЕ5КУРСА;

CREATE PROCEDURE ГП_ПРОЦ_УДАЛЕНИЕСТУДЕНТОВВЫШЕ5КУРСА
() LANGUAGE SQL BEGIN 
	-- Повышение курса
	UPDATE ГП_СПР_Студенты SET гп_курс = гп_курс + 1;
	-- Удаление отметок студента курса выше 5-ого
	DELETE FROM
	    ГП_ДОК_ЭкзамОтметки
	WHERE гп_студентКод IN (
	        SELECT id
	        FROM ГП_СПР_Студенты
	        WHERE гп_курс > 5
	    );
	-- Удаление данных о студенте курса выше 5-ого
	DELETE FROM ГП_СПР_Студенты WHERE гп_курс > 5;
END; 

DROP VIEW
    IF EXISTS ГП_ПРДС_КОЛИЧЕСТВОСТУДЕНТОВУНИВЕРСИТЕТАПОКУРСАМ;

CREATE VIEW ГП_ПРДС_КОЛИЧЕСТВОСТУДЕНТОВУНИВЕРСИТЕТАПОКУРСАМ 
AS 
	 (
	    SELECT
	        Универ.id AS КодУнивера,
	        CONCAT(
	            CAST(
	                Универ.гп_наименование AS VARCHAR(64)
	            ),
	            '...'
	        ) AS НаименованиеУнивера,
	        Студенты1Курса.КолСтудУнивера AS КолСтуд1Курса,
	        Студенты2Курса.КолСтудУнивера AS КолСтуд2Курса,
	        Студенты3Курса.КолСтудУнивера AS КолСтуд3Курса,
	        Студенты4Курса.КолСтудУнивера AS КолСтуд4Курса,
	        Студенты5Курса.КолСтудУнивера AS КолСтуд5Курса
	    FROM
	        ГП_СПР_Университеты AS Универ
	        LEFT JOIN (
	            SELECT
	                гп_университетКод AS КодУнивера,
	                COUNT(*) AS КолСтудУнивера
	            FROM
	                ГП_СПР_Студенты
	            WHERE гп_курс = 1
	            GROUP BY
	                гп_университетКод
	            ORDER BY
	                гп_университетКод
	        ) AS Студенты1Курса ON Студенты1Курса.КодУнивера = Универ.id
	        LEFT JOIN (
	            SELECT
	                гп_университетКод AS КодУнивера,
	                COUNT(*) AS КолСтудУнивера
	            FROM
	                ГП_СПР_Студенты
	            WHERE гп_курс = 2
	            GROUP BY
	                гп_университетКод
	            ORDER BY
	                гп_университетКод
	        ) AS Студенты2Курса ON Студенты2Курса.КодУнивера = Универ.id
	        LEFT JOIN (
	            SELECT
	                гп_университетКод AS КодУнивера,
	                COUNT(*) AS КолСтудУнивера
	            FROM
	                ГП_СПР_Студенты
	            WHERE гп_курс = 3
	            GROUP BY
	                гп_университетКод
	            ORDER BY
	                гп_университетКод
	        ) AS Студенты3Курса ON Студенты3Курса.КодУнивера = Универ.id
	        LEFT JOIN (
	            SELECT
	                гп_университетКод AS КодУнивера,
	                COUNT(*) AS КолСтудУнивера
	            FROM
	                ГП_СПР_Студенты
	            WHERE гп_курс = 4
	            GROUP BY
	                гп_университетКод
	            ORDER BY
	                гп_университетКод
	        ) AS Студенты4Курса ON Студенты4Курса.КодУнивера = Универ.id
	        LEFT JOIN (
	            SELECT
	                гп_университетКод AS КодУнивера,
	                COUNT(*) AS КолСтудУнивера
	            FROM
	                ГП_СПР_Студенты
	            WHERE гп_курс = 5
	            GROUP BY
	                гп_университетКод
	            ORDER BY
	                гп_университетКод
	        ) AS Студенты5Курса ON Студенты5Курса.КодУнивера = Универ.id
	    ORDER BY id
	)
; 

SELECT * FROM ГП_ПРДС_КОЛИЧЕСТВОСТУДЕНТОВУНИВЕРСИТЕТАПОКУРСАМ;

CALL ГП_ПРОЦ_УДАЛЕНИЕСТУДЕНТОВВЫШЕ5КУРСА();

SELECT * FROM ГП_ПРДС_КОЛИЧЕСТВОСТУДЕНТОВУНИВЕРСИТЕТАПОКУРСАМ;