INSERT INTO DE_CTL_Subjects
(de_course, de_semestr, de_name)
VALUES
(1, 1, 'Математика'),
(1, 1, 'Основы компьютерной техники'),
(1, 1, 'Интегрированный модуль Философия'),
(1, 1, 'Основы автоматизации и программирования'),
(1, 1, 'Безопасность жизнедеятельности человека'),
(1, 2, 'Основы автоматизации и программирования'),
(1, 2, 'Иностранный язык'),
(1, 2, 'Математика');

INSERT INTO DE_CTL_Subjects
(de_course, de_semestr, de_name, de_hours)
VALUES
(2, 3, 'Дискретная математика', '162'),
(2, 3, 'Математика', '192'),
(2, 3, 'Языки программирования', '202'),
(2, 3, 'Физика', '198'),
(2, 4, 'Операционные системы и системное программирование', '220'),
(2, 4, 'Теория вероятности и математическая статистика', '144'),
(2, 4, 'Объектно-ориентированные технологии программирования и стандарты проектирования', '154'),
(2, 4, 'Компьютерные системы и сети', '194'),
(2, 4, 'Веб технологии', '180'),
(3, 5, 'Надежность программного обеспепчения', '180'),
(3, 5, 'Операционные системы и системное программирование', '160'),
(3, 5, 'Прикладные системы обработки данных', '124'),
(3, 5, 'Объектно-ориентированные технологии программирования и стандарты проектирования', '154'),
(3, 6, 'Интегрированный модуль Экономика', '144'),
(3, 6, 'Современные платформы программирования', '160'),
(3, 6, 'Разработка программного обеспечения для мобильных платформ', '120'),
(3, 6, 'Базы данных', '144'),
(3, 6, 'Основы бизнеса и права в информационных технологиях', '172'),
(4, 7, 'Базы данных', '180'),
(4, 7, 'Методы обработки данных', '170'),
(4, 7, 'Безопасность компьютерных систем и сетей', '124');
