
DROP TRIGGER IF EXISTS ГП_ТРГР_СчетСреднегоБаллаУнивераПриИзмененииОтметки;

CREATE TRIGGER ГП_ТРГР_СчетСреднегоБаллаУнивераПриИзмененииОтметки 
AFTER UPDATE ON ГП_ДОК_ЭкзамОтметки FOR EACH ROW BEGIN 
    -- Переменная для хранения кода универа
    SET @КодУнивера = (
            SELECT
                гп_университетКод
            FROM ГП_СПР_Студенты
            WHERE
                id = NEW.гп_студентКод
        );
    -- Переменная для хранения среднего балла универа
    SET @СреднийБаллУнивера = (
            SELECT
                AVG(гп_отметка)
            FROM
                ГП_ДОК_ЭкзамОтметки AS ЭкзамОтметки
                INNER JOIN ГП_СПР_Студенты AS Студенты ON Студенты.id = ЭкзамОтметки.гп_студентКод
            GROUP BY
                гп_университетКод
            HAVING
                гп_университетКод = @КодУнивера
        );
    -- Обновляем средний бал универу
    UPDATE
        ГП_СПР_Университеты
    SET гп_средБаллУнивера = @СреднийБаллУнивера
    WHERE id = @КодУнивера;
END; 

SELECT
    id AS КодУнивера,
    гп_средБаллУнивера AS СредБаллУнивера
FROM ГП_СПР_Университеты;

UPDATE ГП_ДОК_ЭкзамОтметки
SET гп_отметка = 5
WHERE id = (
        SELECT id
        FROM
            ГП_ДОК_ЭкзамОтметки
        WHERE
            гп_дата = '2022-12-11'
        ORDER BY id DESC
        LIMIT 1
    );

SELECT
    id AS КодУнивера,
    гп_средБаллУнивера AS СредБаллУнивера
FROM ГП_СПР_Университеты;
