
DROP TRIGGER IF EXISTS ГП_ТРГР_СчетКоличСтудУнивераПриЗачислении;

CREATE TRIGGER ГП_ТРГР_СчетКоличСтудУнивераПриЗачислении 
AFTER INSERT ON ГП_СПР_Студенты FOR EACH ROW BEGIN 
	UPDATE ГП_СПР_Университеты
	SET гп_количСтудентов = (
	        SELECT
	            COUNT(гп_университетКод)
	        FROM ГП_СПР_Студенты
	        WHERE
	            гп_университетКод = NEW.гп_университетКод
	        GROUP BY
	            гп_университетКод
	    )
	WHERE
	    id = NEW.гп_университетКод;
END; 

SELECT
    id AS КодУнивера,
    гп_количСтудентов AS КолСтудУнивера
FROM ГП_СПР_Университеты;

INSERT INTO ГП_СПР_Студенты
(гп_фамилия, гп_имя, гп_отчество, гп_курс, гп_деньРождения, гп_университетКод, гп_городКод)
VALUES
('Иванов', 'Иван', 'Иванович', 1, '2000-01-01', 1, 1),
('Иванов', 'Иван', 'Иванович', 1, '2000-01-01', 2, 1),
('Иванов', 'Иван', 'Иванович', 1, '2000-01-01', 3, 1);

SELECT
    id AS КодУнивера,
    гп_количСтудентов AS КолСтудУнивера
FROM ГП_СПР_Университеты;
